test_new/Lagrangian/VoF/0/compressibleVoF/T.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/compressibleVoF";
    object      T.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    bottom
    {
        type            calculated;
        value           uniform 300;
    }
    top
    {
        type            calculated;
        value           uniform 300;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
